from flask import Flask
import random

symbols = 'qwertyuiopasdfghjklzxcvbnm1234567890!@#$%^&*()_+-=~QWERTYUIOPASDFGHJKLZXCVBNM'
fact_list = ['Большинство людей, страдающих технологической зависимостью, испытывают сильный стресс, когда они находятся вне зоны покрытия сети или не могут использовать свои устройства.',
    'Согласно исследованию, проведенному в 2018 году, более 50% людей в возрасте от 18 до 34 лет считают себя зависимыми от своих смартфонов.',
    'Изучение технологической зависимости является одной из наиболее актуальных областей научных исследований в настоящее время.',
    'Согласно исследованию, проведенному в 2019 году, более 60% людей отвечают на рабочие сообщения в своих смартфонах в течение 15 минут после того, как они вышли с работы.',
    'Один из способов борьбы с технологической зависимостью - это поиск занятий, которые приносят удовольствие и улучшают настроение.',
    'Илон Маск утверждает, что социальные сети созданы для того, чтобы удерживать нас внутри платформы, чтобы мы тратили как можно больше времени на просмотр контента.',
    'Илон Маск также выступает за регулирование социальных сетей и защиту личных данных пользователей. Он утверждает, что социальные сети собирают огромное количество информации о нас, которую потом можно использовать для манипулирования нашими мыслями и поведением.',
    'Социальные сети имеют как позитивные, так и негативные стороны, и мы должны быть более осознанными в использовании этих платформ.']

app = Flask(__name__)

@app.route("/")
def h1():
    return f'<h1 style="text-align: center;">Рандомный факт про технологические зависимости:</h1>' + '<div style="text-align:center; width:100%"><a style="font-size: 20px;" href="/random_fact">Посмотреть случайный факт</a></div>' + '<p></p>' + '<div style="text-align:center; width:100%"><a style="font-size: 20px;" href="/rand_pass">Сгенерировать пароль</a></div>'

@app.route("/random_fact")
def rand_fact():
    return f'<p style="font-size: 24px; text-align: center;">{random.choice(fact_list)}</p>' + "<div style='text-align:center; width:100%'><a style='font-size: 20px;' href='/'>Главная страница</a></div>"

@app.route("/rand_pass")
def rand_pass():
    pass_l = random.choices(symbols, k = 8)
    password = ''
    for i in pass_l:
        password += i
    return f'<h1 style="text-align: center;">Эта вкладка выводит тебе рандомный восьмизначный пароль.</h1>' + f'<p style="font-size: 20px; text-align: center;">Ваш пароль это: {password}</p>' + "<div style='text-align:center; width:100%'><a style='font-size: 20px;' href='/'>Главная страница</a></div>"

app.run(debug = True)
